Revit 2027 API
FamilySizeTableManager.HasSizeTable Method
 Checks if a FamilySizeTable of a given name exists.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSizeTable(
	string tableName
)
Public Function HasSizeTable (
	tableName As String
) As Boolean
public:
bool HasSizeTable(
	String^ tableName
)
member HasSizeTable :
        tableName : string -> bool
Parameters
tableName String
 The name of the FamilySizeTable.
Return Value
Boolean
 True if the FamilySizeTable exists, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace